// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.
//
// let usernum1 = +prompt("ведіть перше число");
// let usernum2 = +prompt("ведіть друге число");
// if (usernum1 > usernum2) {
//     console.log(usernum1);
// } else if (usernum1 === usernum2) {
//     console.log("числа рівні");
// } else {
//     console.log(usernum2);
// };
// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let app = +prompt("Номер квартири");
//
// if (app < 21 && app != 0) {
//     console.log("1 під'їзд");
// } else if (app > 20 && app < 49) {
//     console.log("2 під'їзд");
// } else if (app > 48 && app < 91) {
//     console.log("3 під'їзд");
// } else {
//     console.log("у цьому будинку немає такого номера квартири");
// }



// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
//
// let number = +prompt("Число")
// if (number % 10) {
//     console.log("Невірно")
// } else {
//     console.log("Вірно");
// };

// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else
//
let x = 100500;
// let x = "asdadasd";
// let x = true;
// let x = object;
// let x = null;
if (typeof x === "number") {
    console.log(1);
} else if (typeof x === "string"){
    console.log(2);
} else if (typeof x === "object" || !!x) {
    console.log(3);
} else {
    console.log("else");
};
//
// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

let temperature = 20;
temperature = temperature > 9 && temperature < 23 ? console.log("Okten ми йдемо ВЧИТИСЯ") : console.log("сидимо вдома і вчимося ОНЛАЙН");
// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

let winnerticket = +prompt("Вітаємо ви переможець це Вікторина, будь ласка вакажіть число від 1 до 5");

switch (winnerticket) {
    case 1 :
        console.log("Безкоштовний курс в Okten");
        break;
    case 2 :
        console.log("Новенький iphone");
        break;
    case 3 :
        console.log("Нове авто TOYOTA");
        break;
    case 4 :
        console.log("Купон на безкоштовну стрижку");
        break;
    case 5 :
        console.log("Поїздка до Єгипту");
        break;
    default :
        console.log("Число не вірне....");
}