// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];

if (friends.length > 2) {
    console.log("великий масив");
} else {
    console.log("маленький масив");
}


// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.
//

let a = 2;
let b = 1;
let c = 3;
//
// let a = +prompt("ведіть число а");
// let b = +prompt("ведіть число b");
// let c = +prompt("ведіть число c");

if (a > b && a < c || a < b && a > c)  {
    console.log("середнє число a");
} else if (b > a && b < c || b < a && b > c) {
    console.log("середнє число b");
} else if (c > b && c < a || c < b && c > a) {
    console.log("середнє число c");
}


// - Перепишіть конструкцію if з використанням умовного оператора '?':
let result;
// let a = 1;
// let b = 1;
// --- для перевірки
if (a + b < 4) {
    result = 'Мало';
} else {
    result = 'Багато';
}
console.log(result);

a + b < 4 ? result = "Мало" : result = "Багато";
console.log(result);
result = a + b < 4 ? "Мало" : "Багато";
console.log(result);


// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

let number = Math.round(Math.random() * (100 - (-100)) + (-100));
console.log(number);


number === 0 ? console.log("нульове число") : number < 0 ? console.log("мінусове число") : console.log("плюсове число");